ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVMB_example/Toledo_S12ZVMBA64/S12ZVMBA64_LIN_Slave/Project_Headers/mc9s12zvmba64.h
/*** PIEL - Port L Interrupt Enable Register; 0x00000336 ***/
typedef union {
  byte Byte;
  struct {
    byte PIEL0       :1;                                       /* Port L interrupt enable 0 */
    byte PIEL1       :1;                                       /* Port L interrupt enable 1 */
    byte PIEL2       :1;                                       /* Port L interrupt enable 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPIEL :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PIELSTR;
extern volatile PIELSTR _PIEL @0x00000336;
#define PIEL                            _PIEL.Byte
#define PIEL_PIEL0                      _PIEL.Bits.PIEL0
#define PIEL_PIEL1                      _PIEL.Bits.PIEL1
#define PIEL_PIEL2                      _PIEL.Bits.PIEL2
#define PIEL_PIEL                       _PIEL.MergedBits.grpPIEL

#define PIEL_PIEL0_MASK                 1U
#define PIEL_PIEL1_MASK                 2U
#define PIEL_PIEL2_MASK                 4U
#define PIEL_PIEL_MASK                  7U
#define PIEL_PIEL_BITNUM                0U


/*** PIFL - Port L Interrupt Flag Register; 0x00000337 ***/
typedef union {
  byte Byte;
  struct {
    byte PIFL0       :1;                                       /* Port L interrupt flag 0 */
    byte PIFL1       :1;                                       /* Port L interrupt flag 1 */
    byte PIFL2       :1;                                       /* Port L interrupt flag 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPIFL :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PIFLSTR;
extern volatile PIFLSTR _PIFL @0x00000337;
#define PIFL                            _PIFL.Byte
#define PIFL_PIFL0                      _PIFL.Bits.PIFL0
#define PIFL_PIFL1                      _PIFL.Bits.PIFL1
#define PIFL_PIFL2                      _PIFL.Bits.PIFL2
#define PIFL_PIFL                       _PIFL.MergedBits.grpPIFL

#define PIFL_PIFL0_MASK                 1U
#define PIFL_PIFL1_MASK                 2U
#define PIFL_PIFL2_MASK                 4U
#define PIFL_PIFL_MASK                  7U
#define PIFL_PIFL_BITNUM                0U


/*** PTABYPL - Port L ADC Bypass Register; 0x0000033A ***/
typedef union {
  byte Byte;
  struct {
    byte PTABYPL0    :1;                                       /* Port L ADC Connection Bypass 0 */
    byte PTABYPL1    :1;                                       /* Port L ADC Connection Bypass 1 */
    byte PTABYPL2    :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTABYPL :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTABYPLSTR;
extern volatile PTABYPLSTR _PTABYPL @0x0000033A;
#define PTABYPL                         _PTABYPL.Byte
#define PTABYPL_PTABYPL0                _PTABYPL.Bits.PTABYPL0
#define PTABYPL_PTABYPL1                _PTABYPL.Bits.PTABYPL1
#define PTABYPL_PTABYPL2                _PTABYPL.Bits.PTABYPL2
#define PTABYPL_PTABYPL                 _PTABYPL.MergedBits.grpPTABYPL

#define PTABYPL_PTABYPL0_MASK           1U
#define PTABYPL_PTABYPL1_MASK           2U
#define PTABYPL_PTABYPL2_MASK           4U
#define PTABYPL_PTABYPL_MASK            7U
#define PTABYPL_PTABYPL_BITNUM          0U


/*** PTADIRL - Port L ADC Direct Register; 0x0000033B ***/
typedef union {
  byte Byte;
  struct {
    byte PTADIRL0    :1;                                       /* Port L ADC Direct Connection 0 */
    byte PTADIRL1    :1;                                       /* Port L ADC Direct Connection 1 */
    byte PTADIRL2    :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTADIRL :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTADIRLSTR;
extern volatile PTADIRLSTR _PTADIRL @0x0000033B;
#define PTADIRL                         _PTADIRL.Byte
#define PTADIRL_PTADIRL0                _PTADIRL.Bits.PTADIRL0
#define PTADIRL_PTADIRL1                _PTADIRL.Bits.PTADIRL1
#define PTADIRL_PTADIRL2                _PTADIRL.Bits.PTADIRL2
#define PTADIRL_PTADIRL                 _PTADIRL.MergedBits.grpPTADIRL

#define PTADIRL_PTADIRL0_MASK           1U
#define PTADIRL_PTADIRL1_MASK           2U
#define PTADIRL_PTADIRL2_MASK           4U
#define PTADIRL_PTADIRL_MASK            7U
#define PTADIRL_PTADIRL_BITNUM          0U


/*** DIENL - Port LDigital Input Enable Register; 0x0000033C ***/
typedef union {
  byte Byte;
  struct {
    byte DIENL0      :1;                                       /* Digital input enable 0 */
    byte DIENL1      :1;                                       /* Digital input enable 1 */
    byte DIENL2      :1;                                       /* Digital input enable 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDIENL :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} DIENLSTR;
extern volatile DIENLSTR _DIENL @0x0000033C;
#define DIENL                           _DIENL.Byte
#define DIENL_DIENL0                    _DIENL.Bits.DIENL0
#define DIENL_DIENL1                    _DIENL.Bits.DIENL1
#define DIENL_DIENL2                    _DIENL.Bits.DIENL2
#define DIENL_DIENL                     _DIENL.MergedBits.grpDIENL

#define DIENL_DIENL0_MASK               1U
#define DIENL_DIENL1_MASK               2U
#define DIENL_DIENL2_MASK               4U
#define DIENL_DIENL_MASK                7U
#define DIENL_DIENL_BITNUM              0U


/*** PTAENL - Port L ADC Connection Enable Register; 0x0000033D ***/
typedef union {
  byte Byte;
  struct {
    byte PTAENL0     :1;                                       /* Port L ADC Connection Enable 0 */
    byte PTAENL1     :1;                                       /* Port L ADC Connection Enable 1 */
    byte PTAENL2     :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTAENL :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTAENLSTR;
