ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVMB_example/Toledo_S12ZVMBA64/S12ZVMBA64_LIN_Slave/Project_Headers/mc9s12zvmba64.h
#define PMFFMOD_FMOD0_MASK              1U
#define PMFFMOD_FMOD1_MASK              2U
#define PMFFMOD_FMOD2_MASK              4U
#define PMFFMOD_FMOD3_MASK              8U
#define PMFFMOD_FMOD4_MASK              16U
#define PMFFMOD_FMOD5_MASK              64U
#define PMFFMOD_FMOD_MASK               31U
#define PMFFMOD_FMOD_BITNUM             0U


/*** PMFFIE - PMF Fault Interrupt Enable Register; 0x00000506 ***/
typedef union {
  byte Byte;
  struct {
    byte FIE0        :1;                                       /* Fault 0 Pin Interrupt Enable */
    byte FIE1        :1;                                       /* Fault 1 Pin Interrupt Enable */
    byte FIE2        :1;                                       /* Fault 2 Pin Interrupt Enable */
    byte FIE3        :1;                                       /* Fault 3 Pin Interrupt Enable */
    byte FIE4        :1;                                       /* Fault 4 Pin Interrupt Enable */
    byte             :1; 
    byte FIE5        :1;                                       /* Fault 5 Pin Interrupt Enable */
    byte             :1; 
  } Bits;
  struct {
    byte grpFIE  :5;
    byte         :1;
    byte grpFIE_5 :1;
    byte         :1;
  } MergedBits;
} PMFFIESTR;
extern volatile PMFFIESTR _PMFFIE @0x00000506;
#define PMFFIE                          _PMFFIE.Byte
#define PMFFIE_FIE0                     _PMFFIE.Bits.FIE0
#define PMFFIE_FIE1                     _PMFFIE.Bits.FIE1
#define PMFFIE_FIE2                     _PMFFIE.Bits.FIE2
#define PMFFIE_FIE3                     _PMFFIE.Bits.FIE3
#define PMFFIE_FIE4                     _PMFFIE.Bits.FIE4
#define PMFFIE_FIE5                     _PMFFIE.Bits.FIE5
#define PMFFIE_FIE                      _PMFFIE.MergedBits.grpFIE

#define PMFFIE_FIE0_MASK                1U
#define PMFFIE_FIE1_MASK                2U
#define PMFFIE_FIE2_MASK                4U
#define PMFFIE_FIE3_MASK                8U
#define PMFFIE_FIE4_MASK                16U
#define PMFFIE_FIE5_MASK                64U
#define PMFFIE_FIE_MASK                 31U
#define PMFFIE_FIE_BITNUM               0U


/*** PMFFIF - PMF Fault Interrupt Flag Register; 0x00000507 ***/
typedef union {
  byte Byte;
  struct {
    byte FIF0        :1;                                       /* Fault 0 Interrupt Flag */
    byte FIF1        :1;                                       /* Fault 1 Interrupt Flag */
    byte FIF2        :1;                                       /* Fault 2 Interrupt Flag */
    byte FIF3        :1;                                       /* Fault 3 Interrupt Flag */
    byte FIF4        :1;                                       /* Fault 4 Interrupt Flag */
    byte             :1; 
    byte FIF5        :1;                                       /* Fault 5 Interrupt Flag */
    byte             :1; 
  } Bits;
  struct {
    byte grpFIF  :5;
    byte         :1;
    byte grpFIF_5 :1;
    byte         :1;
  } MergedBits;
} PMFFIFSTR;
extern volatile PMFFIFSTR _PMFFIF @0x00000507;
#define PMFFIF                          _PMFFIF.Byte
#define PMFFIF_FIF0                     _PMFFIF.Bits.FIF0
#define PMFFIF_FIF1                     _PMFFIF.Bits.FIF1
#define PMFFIF_FIF2                     _PMFFIF.Bits.FIF2
#define PMFFIF_FIF3                     _PMFFIF.Bits.FIF3
#define PMFFIF_FIF4                     _PMFFIF.Bits.FIF4
#define PMFFIF_FIF5                     _PMFFIF.Bits.FIF5
#define PMFFIF_FIF                      _PMFFIF.MergedBits.grpFIF

#define PMFFIF_FIF0_MASK                1U
#define PMFFIF_FIF1_MASK                2U
#define PMFFIF_FIF2_MASK                4U
#define PMFFIF_FIF3_MASK                8U
#define PMFFIF_FIF4_MASK                16U
#define PMFFIF_FIF5_MASK                64U
#define PMFFIF_FIF_MASK                 31U
#define PMFFIF_FIF_BITNUM               0U


/*** PMFQSMP0 - PMF Fault Qualifying Samples Register 0; 0x00000508 ***/
typedef union {
  byte Byte;
  struct {
    byte QSMP4       :2;                                       /* Fault 4 Qualifying Samples */
    byte QSMP5       :2;                                       /* Fault 5 Qualifying Samples */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} PMFQSMP0STR;
extern volatile PMFQSMP0STR _PMFQSMP0 @0x00000508;
#define PMFQSMP0                        _PMFQSMP0.Byte
#define PMFQSMP0_QSMP4                  _PMFQSMP0.Bits.QSMP4
#define PMFQSMP0_QSMP5                  _PMFQSMP0.Bits.QSMP5
/* PMFQSMP_ARR: Access 2 PMFQSMPx registers in an array */
#define PMFQSMP_ARR                     ((volatile byte *) &PMFQSMP0)

#define PMFQSMP0_QSMP4_MASK             3U
#define PMFQSMP0_QSMP4_BITNUM           0U
#define PMFQSMP0_QSMP5_MASK             12U
#define PMFQSMP0_QSMP5_BITNUM           2U


/*** PMFQSMP1 - PMF Fault Qualifying Samples Register 1; 0x00000509 ***/
typedef union {
  byte Byte;
  struct {
    byte QSMP0       :2;                                       /* Fault 0 Qualifying Samples */
    byte QSMP1       :2;                                       /* Fault 1 Qualifying Samples */
    byte QSMP2       :2;                                       /* Fault 2 Qualifying Samples */
    byte QSMP3       :2;                                       /* Fault 3 Qualifying Samples */
  } Bits;
} PMFQSMP1STR;
extern volatile PMFQSMP1STR _PMFQSMP1 @0x00000509;
#define PMFQSMP1                        _PMFQSMP1.Byte
#define PMFQSMP1_QSMP0                  _PMFQSMP1.Bits.QSMP0
#define PMFQSMP1_QSMP1                  _PMFQSMP1.Bits.QSMP1
#define PMFQSMP1_QSMP2                  _PMFQSMP1.Bits.QSMP2
#define PMFQSMP1_QSMP3                  _PMFQSMP1.Bits.QSMP3

#define PMFQSMP1_QSMP0_MASK             3U
#define PMFQSMP1_QSMP0_BITNUM           0U
#define PMFQSMP1_QSMP1_MASK             12U
#define PMFQSMP1_QSMP1_BITNUM           2U
#define PMFQSMP1_QSMP2_MASK             48U
#define PMFQSMP1_QSMP2_BITNUM           4U
#define PMFQSMP1_QSMP3_MASK             192U
#define PMFQSMP1_QSMP3_BITNUM           6U


/*** PMFOUTC - PMF Output Control Register; 0x0000050C ***/
typedef union {
  byte Byte;
  struct {
    byte OUTCTL0     :1;                                       /* OUTCTL0 Bits */
    byte OUTCTL1     :1;                                       /* OUTCTL1 Bits */
    byte OUTCTL2     :1;                                       /* OUTCTL2 Bits */
    byte OUTCTL3     :1;                                       /* OUTCTL3 Bits */
    byte OUTCTL4     :1;                                       /* OUTCTL4 Bits */
    byte OUTCTL5     :1;                                       /* OUTCTL5 Bits */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpOUTCTL :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} PMFOUTCSTR;
extern volatile PMFOUTCSTR _PMFOUTC @0x0000050C;
#define PMFOUTC                         _PMFOUTC.Byte
#define PMFOUTC_OUTCTL0                 _PMFOUTC.Bits.OUTCTL0
#define PMFOUTC_OUTCTL1                 _PMFOUTC.Bits.OUTCTL1
#define PMFOUTC_OUTCTL2                 _PMFOUTC.Bits.OUTCTL2
#define PMFOUTC_OUTCTL3                 _PMFOUTC.Bits.OUTCTL3
#define PMFOUTC_OUTCTL4                 _PMFOUTC.Bits.OUTCTL4
#define PMFOUTC_OUTCTL5                 _PMFOUTC.Bits.OUTCTL5
#define PMFOUTC_OUTCTL                  _PMFOUTC.MergedBits.grpOUTCTL

#define PMFOUTC_OUTCTL0_MASK            1U
#define PMFOUTC_OUTCTL1_MASK            2U
#define PMFOUTC_OUTCTL2_MASK            4U
#define PMFOUTC_OUTCTL3_MASK            8U
#define PMFOUTC_OUTCTL4_MASK            16U
#define PMFOUTC_OUTCTL5_MASK            32U
#define PMFOUTC_OUTCTL_MASK             63U
#define PMFOUTC_OUTCTL_BITNUM           0U


