ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVMB_example/Toledo_S12ZVMBA64/S12ZVMBA64_LIN_Slave/Project_Headers/mc9s12zvmba64.h
/*** GDUCSO - GDU Current Sense Offset Register; 0x000006AA ***/
typedef union {
  byte Byte;
  struct {
    byte GCSO0       :3;                                       /* GDU Current Sense Amplifier 0 Offset */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} GDUCSOSTR;
extern volatile GDUCSOSTR _GDUCSO @0x000006AA;
#define GDUCSO                          _GDUCSO.Byte
#define GDUCSO_GCSO0                    _GDUCSO.Bits.GCSO0

#define GDUCSO_GCSO0_MASK               7U
#define GDUCSO_GCSO0_BITNUM             0U


/*** GDUDSLVL - GDU Desaturation Level Register; 0x000006AB ***/
typedef union {
  byte Byte;
  struct {
    byte GDSLLS      :3;                                       /* GDU Desaturation Level for Low-Side Drivers */
    byte GDSFLS      :1;                                       /* GDU Desaturation Filter Characteristic for Low-Side Drivers */
    byte GDSLHS      :3;                                       /* GDU Desaturation Level for High-Side Drivers */
    byte GDSFHS      :1;                                       /* GDU Desaturation Filter Characteristic for High-Side Drivers */
  } Bits;
} GDUDSLVLSTR;
extern volatile GDUDSLVLSTR _GDUDSLVL @0x000006AB;
#define GDUDSLVL                        _GDUDSLVL.Byte
#define GDUDSLVL_GDSLLS                 _GDUDSLVL.Bits.GDSLLS
#define GDUDSLVL_GDSFLS                 _GDUDSLVL.Bits.GDSFLS
#define GDUDSLVL_GDSLHS                 _GDUDSLVL.Bits.GDSLHS
#define GDUDSLVL_GDSFHS                 _GDUDSLVL.Bits.GDSFHS

#define GDUDSLVL_GDSLLS_MASK            7U
#define GDUDSLVL_GDSLLS_BITNUM          0U
#define GDUDSLVL_GDSFLS_MASK            8U
#define GDUDSLVL_GDSLHS_MASK            112U
#define GDUDSLVL_GDSLHS_BITNUM          4U
#define GDUDSLVL_GDSFHS_MASK            128U


/*** GDUPHL - GDU Phase Log Register; 0x000006AC ***/
typedef union {
  byte Byte;
  struct {
    byte GPHL        :2;                                       /* GDU Phase Log Bits */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} GDUPHLSTR;
extern volatile GDUPHLSTR _GDUPHL @0x000006AC;
#define GDUPHL                          _GDUPHL.Byte
#define GDUPHL_GPHL                     _GDUPHL.Bits.GPHL

#define GDUPHL_GPHL_MASK                3U
#define GDUPHL_GPHL_BITNUM              0U


/*** GDUCLK2 - GDU Clock Control Register 2; 0x000006AD ***/
typedef union {
  byte Byte;
  struct {
    byte GCPCD       :4;                                       /* GDU Charge Pump Clock Divider */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} GDUCLK2STR;
extern volatile GDUCLK2STR _GDUCLK2 @0x000006AD;
#define GDUCLK2                         _GDUCLK2.Byte
#define GDUCLK2_GCPCD                   _GDUCLK2.Bits.GCPCD

#define GDUCLK2_GCPCD_MASK              15U
#define GDUCLK2_GCPCD_BITNUM            0U


/*** GDUOC0 - GDU Overcurrent Register 0; 0x000006AE ***/
typedef union {
  byte Byte;
  struct {
    byte GOCT0       :5;                                       /* GDU Overcurrent Comparator Threshold */
    byte             :1; 
    byte GOCE0       :1;                                       /* GDU Overcurrent Comparator Enable */
    byte GOCA0       :1;                                       /* GDU Overcurrent Action */
  } Bits;
} GDUOC0STR;
extern volatile GDUOC0STR _GDUOC0 @0x000006AE;
#define GDUOC0                          _GDUOC0.Byte
#define GDUOC0_GOCT0                    _GDUOC0.Bits.GOCT0
#define GDUOC0_GOCE0                    _GDUOC0.Bits.GOCE0
#define GDUOC0_GOCA0                    _GDUOC0.Bits.GOCA0

#define GDUOC0_GOCT0_MASK               31U
#define GDUOC0_GOCT0_BITNUM             0U
#define GDUOC0_GOCE0_MASK               64U
#define GDUOC0_GOCA0_MASK               128U


/*** GDUCTR1 - GDU Control Register 1; 0x000006B0 ***/
typedef union {
  byte Byte;
  struct {
    byte TDEL        :1;                                       /* GDU Slew Mode */
    byte GBSWOFF     :2;                                       /* GDU Bootstrap Switches Off */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} GDUCTR1STR;
extern volatile GDUCTR1STR _GDUCTR1 @0x000006B0;
#define GDUCTR1                         _GDUCTR1.Byte
#define GDUCTR1_TDEL                    _GDUCTR1.Bits.TDEL
#define GDUCTR1_GBSWOFF                 _GDUCTR1.Bits.GBSWOFF

#define GDUCTR1_TDEL_MASK               1U
#define GDUCTR1_GBSWOFF_MASK            6U
#define GDUCTR1_GBSWOFF_BITNUM          1U


/*** CPMURFLG - CPMU Reset Flags Register; 0x000006C3 ***/
typedef union {
  byte Byte;
  struct {
    byte PMRF        :1;                                       /* PLL Clock Monitor Reset Flag */
    byte OMRF        :1;                                       /* Oscillator Clock Monitor Reset Flag */
    byte             :1; 
    byte COPRF       :1;                                       /* COP Reset Flag */
    byte             :1; 
    byte LVRF        :1;                                       /* Low Voltage Reset Flag */
    byte PORF        :1;                                       /* Power on Reset Flag */
    byte             :1; 
  } Bits;
} CPMURFLGSTR;
extern volatile CPMURFLGSTR _CPMURFLG @0x000006C3;
#define CPMURFLG                        _CPMURFLG.Byte
#define CPMURFLG_PMRF                   _CPMURFLG.Bits.PMRF
#define CPMURFLG_OMRF                   _CPMURFLG.Bits.OMRF
#define CPMURFLG_COPRF                  _CPMURFLG.Bits.COPRF
#define CPMURFLG_LVRF                   _CPMURFLG.Bits.LVRF
#define CPMURFLG_PORF                   _CPMURFLG.Bits.PORF

#define CPMURFLG_PMRF_MASK              1U
#define CPMURFLG_OMRF_MASK              2U
#define CPMURFLG_COPRF_MASK             8U
#define CPMURFLG_LVRF_MASK              32U
#define CPMURFLG_PORF_MASK              64U


/*** CPMUSYNR - CPMU Synthesizer Register; 0x000006C4 ***/
typedef union {
  byte Byte;
  struct {
    byte SYNDIV0     :1;                                       /* Multiplication factor of the IPLL bit 0 */
    byte SYNDIV1     :1;                                       /* Multiplication factor of the IPLL bit 1 */
    byte SYNDIV2     :1;                                       /* Multiplication factor of the IPLL bit 2 */
    byte SYNDIV3     :1;                                       /* Multiplication factor of the IPLL bit 3 */
    byte SYNDIV4     :1;                                       /* Multiplication factor of the IPLL bit 4 */
    byte SYNDIV5     :1;                                       /* Multiplication factor of the IPLL bit 5 */
    byte VCOFRQ0     :1;                                       /* VCO frequency range bit 0 */
    byte VCOFRQ1     :1;                                       /* VCO frequency range bit 1 */
  } Bits;
  struct {
    byte grpSYNDIV :6;
    byte grpVCOFRQ :2;
  } MergedBits;
} CPMUSYNRSTR;
extern volatile CPMUSYNRSTR _CPMUSYNR @0x000006C4;
#define CPMUSYNR                        _CPMUSYNR.Byte
#define CPMUSYNR_SYNDIV0                _CPMUSYNR.Bits.SYNDIV0
#define CPMUSYNR_SYNDIV1                _CPMUSYNR.Bits.SYNDIV1
#define CPMUSYNR_SYNDIV2                _CPMUSYNR.Bits.SYNDIV2
#define CPMUSYNR_SYNDIV3                _CPMUSYNR.Bits.SYNDIV3
#define CPMUSYNR_SYNDIV4                _CPMUSYNR.Bits.SYNDIV4
#define CPMUSYNR_SYNDIV5                _CPMUSYNR.Bits.SYNDIV5
#define CPMUSYNR_VCOFRQ0                _CPMUSYNR.Bits.VCOFRQ0
#define CPMUSYNR_VCOFRQ1                _CPMUSYNR.Bits.VCOFRQ1
#define CPMUSYNR_SYNDIV                 _CPMUSYNR.MergedBits.grpSYNDIV
#define CPMUSYNR_VCOFRQ                 _CPMUSYNR.MergedBits.grpVCOFRQ

#define CPMUSYNR_SYNDIV0_MASK           1U
#define CPMUSYNR_SYNDIV1_MASK           2U
#define CPMUSYNR_SYNDIV2_MASK           4U
#define CPMUSYNR_SYNDIV3_MASK           8U
#define CPMUSYNR_SYNDIV4_MASK           16U
#define CPMUSYNR_SYNDIV5_MASK           32U
#define CPMUSYNR_VCOFRQ0_MASK           64U
#define CPMUSYNR_VCOFRQ1_MASK           128U
#define CPMUSYNR_SYNDIV_MASK            63U
#define CPMUSYNR_SYNDIV_BITNUM          0U
#define CPMUSYNR_VCOFRQ_MASK            192U
#define CPMUSYNR_VCOFRQ_BITNUM          6U


/*** CPMUREFDIV - CPMU Reference Divider Register; 0x000006C5 ***/
typedef union {
  byte Byte;
  struct {
    byte REFDIV0     :1;                                       /* Finer granularity for the IPLL multiplier steps bit 0 */
    byte REFDIV1     :1;                                       /* Finer granularity for the IPLL multiplier steps bit 1 */
    byte REFDIV2     :1;                                       /* Finer granularity for the IPLL multiplier steps bit 2 */
    byte REFDIV3     :1;                                       /* Finer granularity for the IPLL multiplier steps bit 3 */
    byte             :1; 
    byte             :1; 
    byte REFFRQ0     :1;                                       /* IPLL optimal stability and lock time configuration bit 0 */
    byte REFFRQ1     :1;                                       /* IPLL optimal stability and lock time configuration bit 1 */
  } Bits;
  struct {
    byte grpREFDIV :4;
    byte         :1;
    byte         :1;
    byte grpREFFRQ :2;
  } MergedBits;
} CPMUREFDIVSTR;
extern volatile CPMUREFDIVSTR _CPMUREFDIV @0x000006C5;
#define CPMUREFDIV                      _CPMUREFDIV.Byte
#define CPMUREFDIV_REFDIV0              _CPMUREFDIV.Bits.REFDIV0
#define CPMUREFDIV_REFDIV1              _CPMUREFDIV.Bits.REFDIV1
#define CPMUREFDIV_REFDIV2              _CPMUREFDIV.Bits.REFDIV2
#define CPMUREFDIV_REFDIV3              _CPMUREFDIV.Bits.REFDIV3
#define CPMUREFDIV_REFFRQ0              _CPMUREFDIV.Bits.REFFRQ0
#define CPMUREFDIV_REFFRQ1              _CPMUREFDIV.Bits.REFFRQ1
#define CPMUREFDIV_REFDIV               _CPMUREFDIV.MergedBits.grpREFDIV
#define CPMUREFDIV_REFFRQ               _CPMUREFDIV.MergedBits.grpREFFRQ

