ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVMB_example/Toledo_S12ZVMBA64/S12ZVMBA64_LIN_Slave/Project_Headers/mc9s12zvmba64.h
#define LP0IE_LPOCIE_MASK               64U
#define LP0IE_LPDTIE_MASK               128U


/*** LP0IF - LIN Interrupt Flags Register; 0x00000987 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte LPOCIF      :1;                                       /* LIN transmitter over-current interrupt flag */
    byte LPDTIF      :1;                                       /* LIN Transmitter TxD-dominant timeout Interrupt Flag */
  } Bits;
} LP0IFSTR;
extern volatile LP0IFSTR _LP0IF @0x00000987;
#define LP0IF                           _LP0IF.Byte
#define LP0IF_LPOCIF                    _LP0IF.Bits.LPOCIF
#define LP0IF_LPDTIF                    _LP0IF.Bits.LPDTIF

#define LP0IF_LPOCIF_MASK               64U
#define LP0IF_LPDTIF_MASK               128U


/*** HSDR - Port HS Data Register; 0x000009C0 ***/
typedef union {
  byte Byte;
  struct {
    byte HSDR0       :1;                                       /* Port HS Data Bit 0 */
    byte HSDR1       :1;                                       /* Port HS Data Bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpHSDR :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} HSDRSTR;
extern volatile HSDRSTR _HSDR @0x000009C0;
#define HSDR                            _HSDR.Byte
#define HSDR_HSDR0                      _HSDR.Bits.HSDR0
#define HSDR_HSDR1                      _HSDR.Bits.HSDR1
#define HSDR_HSDR                       _HSDR.MergedBits.grpHSDR

#define HSDR_HSDR0_MASK                 1U
#define HSDR_HSDR1_MASK                 2U
#define HSDR_HSDR_MASK                  3U
#define HSDR_HSDR_BITNUM                0U


/*** HSCR - HSDRV Configuration Register; 0x000009C1 ***/
typedef union {
  byte Byte;
  struct {
    byte HSE0        :1;                                       /* HSDRV Enable Bit 0 */
    byte HSE1        :1;                                       /* HSDRV Enable Bit 1 */
    byte HSOLE0      :1;                                       /* HSDRV High-Load resistance Open-Load Detection Enable Bit 0 */
    byte HSOLE1      :1;                                       /* HSDRV High-Load resistance Open-Load Detection Enable Bit 1 */
    byte HSOCME0     :1;                                       /* HSDRV Over-Current Mask Enable Bit0 */
    byte HSOCME1     :1;                                       /* HSDRV Over-Current Mask Enable Bit1 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpHSE  :2;
    byte grpHSOLE :2;
    byte grpHSOCME :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} HSCRSTR;
extern volatile HSCRSTR _HSCR @0x000009C1;
#define HSCR                            _HSCR.Byte
#define HSCR_HSE0                       _HSCR.Bits.HSE0
#define HSCR_HSE1                       _HSCR.Bits.HSE1
#define HSCR_HSOLE0                     _HSCR.Bits.HSOLE0
#define HSCR_HSOLE1                     _HSCR.Bits.HSOLE1
#define HSCR_HSOCME0                    _HSCR.Bits.HSOCME0
#define HSCR_HSOCME1                    _HSCR.Bits.HSOCME1
#define HSCR_HSE                        _HSCR.MergedBits.grpHSE
#define HSCR_HSOLE                      _HSCR.MergedBits.grpHSOLE
#define HSCR_HSOCME                     _HSCR.MergedBits.grpHSOCME

#define HSCR_HSE0_MASK                  1U
#define HSCR_HSE1_MASK                  2U
#define HSCR_HSOLE0_MASK                4U
#define HSCR_HSOLE1_MASK                8U
#define HSCR_HSOCME0_MASK               16U
#define HSCR_HSOCME1_MASK               32U
#define HSCR_HSE_MASK                   3U
#define HSCR_HSE_BITNUM                 0U
#define HSCR_HSOLE_MASK                 12U
#define HSCR_HSOLE_BITNUM               2U
#define HSCR_HSOCME_MASK                48U
#define HSCR_HSOCME_BITNUM              4U


/*** HSSLR - HSDRV Slew Rate Control Register; 0x000009C2 ***/
typedef union {
  byte Byte;
  struct {
    byte HSSLEN0     :1;                                       /* Slew Rate Control Enable 0 */
    byte HSSLEN1     :1;                                       /* Slew Rate Control Enable 1 */
    byte HSSLCU0     :1;                                       /* Slew Current Reduction Enable 0 */
    byte HSSLCU1     :1;                                       /* Slew Current Reduction Enable 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpHSSLEN :2;
    byte grpHSSLCU :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} HSSLRSTR;
extern volatile HSSLRSTR _HSSLR @0x000009C2;
#define HSSLR                           _HSSLR.Byte
#define HSSLR_HSSLEN0                   _HSSLR.Bits.HSSLEN0
#define HSSLR_HSSLEN1                   _HSSLR.Bits.HSSLEN1
#define HSSLR_HSSLCU0                   _HSSLR.Bits.HSSLCU0
#define HSSLR_HSSLCU1                   _HSSLR.Bits.HSSLCU1
#define HSSLR_HSSLEN                    _HSSLR.MergedBits.grpHSSLEN
#define HSSLR_HSSLCU                    _HSSLR.MergedBits.grpHSSLCU

#define HSSLR_HSSLEN0_MASK              1U
#define HSSLR_HSSLEN1_MASK              2U
#define HSSLR_HSSLCU0_MASK              4U
#define HSSLR_HSSLCU1_MASK              8U
#define HSSLR_HSSLEN_MASK               3U
#define HSSLR_HSSLEN_BITNUM             0U
#define HSSLR_HSSLCU_MASK               12U
#define HSSLR_HSSLCU_BITNUM             2U


/*** HSSR - HSDRV Status Register; 0x000009C5 ***/
typedef union {
  byte Byte;
  struct {
    byte HSOL0       :1;                                       /* HSDRV Open-Load Status Bit 0 */
    byte HSOL1       :1;                                       /* HSDRV Open-Load Status Bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpHSOL :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} HSSRSTR;
extern volatile HSSRSTR _HSSR @0x000009C5;
#define HSSR                            _HSSR.Byte
#define HSSR_HSOL0                      _HSSR.Bits.HSOL0
#define HSSR_HSOL1                      _HSSR.Bits.HSOL1
#define HSSR_HSOL                       _HSSR.MergedBits.grpHSOL

#define HSSR_HSOL0_MASK                 1U
#define HSSR_HSOL1_MASK                 2U
#define HSSR_HSOL_MASK                  3U
#define HSSR_HSOL_BITNUM                0U


