ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVMB_example/Toledo_S12ZVMBA64/S12ZVMBA64_LIN_Slave/Project_Headers/mc9s12zvmba64.h
/*** NVFSEC - Non Volatile Flash Security Register; 0x00FFFE0F ***/
typedef union {
  byte Byte;
  struct {
    byte SEC0        :1;                                       /* Flash Security Bit 0 */
    byte SEC1        :1;                                       /* Flash Security Bit 1 */
    byte RNV2        :1;                                       /* Reserved Nonvolatile Bit 2 */
    byte RNV3        :1;                                       /* Reserved Nonvolatile Bit 3 */
    byte RNV4        :1;                                       /* Reserved Nonvolatile Bit 4 */
    byte RNV5        :1;                                       /* Reserved Nonvolatile Bit 5 */
    byte KEYEN0      :1;                                       /* Backdoor Key Security Enable Bit 0 */
    byte KEYEN1      :1;                                       /* Backdoor Key Security Enable Bit 1 */
  } Bits;
  struct {
    byte grpSEC  :2;
    byte grpRNV_2 :4;
    byte grpKEYEN :2;
  } MergedBits;
} NVFSECSTR;
/* Tip for register initialization in the user code:  const byte NVFSEC_INIT @0x00FFFE0F = <NVFSEC_INITVAL>; */
#define _NVFSEC (*(const NVFSECSTR *)0x00FFFE0F)
#define NVFSEC                          _NVFSEC.Byte
#define NVFSEC_SEC0                     _NVFSEC.Bits.SEC0
#define NVFSEC_SEC1                     _NVFSEC.Bits.SEC1
#define NVFSEC_RNV2                     _NVFSEC.Bits.RNV2
#define NVFSEC_RNV3                     _NVFSEC.Bits.RNV3
#define NVFSEC_RNV4                     _NVFSEC.Bits.RNV4
#define NVFSEC_RNV5                     _NVFSEC.Bits.RNV5
#define NVFSEC_KEYEN0                   _NVFSEC.Bits.KEYEN0
#define NVFSEC_KEYEN1                   _NVFSEC.Bits.KEYEN1
#define NVFSEC_SEC                      _NVFSEC.MergedBits.grpSEC
#define NVFSEC_RNV_2                    _NVFSEC.MergedBits.grpRNV_2
#define NVFSEC_KEYEN                    _NVFSEC.MergedBits.grpKEYEN
#define NVFSEC_RNV                      NVFSEC_RNV_2

#define NVFSEC_SEC0_MASK                1U
#define NVFSEC_SEC1_MASK                2U
#define NVFSEC_RNV2_MASK                4U
#define NVFSEC_RNV3_MASK                8U
#define NVFSEC_RNV4_MASK                16U
#define NVFSEC_RNV5_MASK                32U
#define NVFSEC_KEYEN0_MASK              64U
#define NVFSEC_KEYEN1_MASK              128U
#define NVFSEC_SEC_MASK                 3U
#define NVFSEC_SEC_BITNUM               0U
#define NVFSEC_RNV_2_MASK               60U
#define NVFSEC_RNV_2_BITNUM             2U
#define NVFSEC_KEYEN_MASK               192U
#define NVFSEC_KEYEN_BITNUM             6U


/* * * * *  24-BIT ADDRESS REGISTERS  * * * * * * * * * * * * * * * * * * * * * * */
extern volatile void* volatile MMCPC @0x00000085;          /* Captured S12ZCPU Program Counter Low; 0x00000087 */
extern volatile void* volatile DBGAA @0x00000115;          /* Debug Comparator A Address Register Low; 0x00000117 */
extern volatile void* volatile DBGBA @0x00000125;          /* Debug Comparator B Address Register Low; 0x00000127 */
extern volatile void* volatile DBGDA @0x00000145;          /* Debug Comparator D Address Register Low; 0x00000147 */
extern volatile void* volatile ECCDPTR @0x000003C7;        /* ECC Debug Pointer Register Low; 0x000003C9 */
extern volatile void* volatile PTUPTR @0x00000591;         /* PTU Pointer Register; 0x00000593 */


  /* Watchdog reset macro */
#ifndef __RESET_WATCHDOG
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() (CPMUARMCOP = 0x55U, CPMUARMCOP = 0xAAU)
#endif
#endif /* __RESET_WATCHDOG */


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */

/* **** 05/10/2015 06:22:00 PM */

#define VectorNumber_Vports                         This_symb_has_been_depreciated
#define VectorNumber_Vtim0paie                      This_symb_has_been_depreciated
#define VectorNumber_Vtim0paaovf                    This_symb_has_been_depreciated
#define VectorNumber_Vtim0ch7                       This_symb_has_been_depreciated
#define VectorNumber_Vtim0ch6                       This_symb_has_been_depreciated
#define VectorNumber_Vtim0ch5                       This_symb_has_been_depreciated
#define VectorNumber_Vtim0ch4                       This_symb_has_been_depreciated
#define Vports                                      This_symb_has_been_depreciated
#define Vtim0paie                                   This_symb_has_been_depreciated
#define Vtim0paaovf                                 This_symb_has_been_depreciated
#define Vtim0ch7                                    This_symb_has_been_depreciated
#define Vtim0ch6                                    This_symb_has_been_depreciated
#define Vtim0ch5                                    This_symb_has_been_depreciated
#define Vtim0ch4                                    This_symb_has_been_depreciated
#define MODRR1_TRIG0NEG                             This_symb_has_been_depreciated
#define MODRR1_TRIG0NEG_MASK                        This_symb_has_been_depreciated
#define MODRR2_T0C4RR                               This_symb_has_been_depreciated
#define MODRR2_T0C5RR                               This_symb_has_been_depreciated
#define MODRR2_T0C6RR                               This_symb_has_been_depreciated
#define MODRR2_T0C7RR                               This_symb_has_been_depreciated
#define MODRR2_T0C4RR_MASK                          This_symb_has_been_depreciated
#define MODRR2_T0C5RR_MASK                          This_symb_has_been_depreciated
#define MODRR2_T0C6RR_MASK                          This_symb_has_been_depreciated
#define MODRR2_T0C7RR_MASK                          This_symb_has_been_depreciated
#define MODRR5_T1OC3RR                              This_symb_has_been_depreciated
#define MODRR5_T1OC3RR_MASK                         This_symb_has_been_depreciated
#define OCPET_OCPET3                                This_symb_has_been_depreciated
#define OCPET_OCPET_2                               This_symb_has_been_depreciated
#define OCPET_OCPET3_MASK                           This_symb_has_been_depreciated
#define OCPET_OCPET_2_MASK                          This_symb_has_been_depreciated
#define OCPET_OCPET_2_BITNUM                        This_symb_has_been_depreciated
#define OCIET_OCIET3                                This_symb_has_been_depreciated
#define OCIET_OCIET_2                               This_symb_has_been_depreciated
#define OCIET_OCIET3_MASK                           This_symb_has_been_depreciated
#define OCIET_OCIET_2_MASK                          This_symb_has_been_depreciated
#define OCIET_OCIET_2_BITNUM                        This_symb_has_been_depreciated
#define OCIFT_OCIFT3                                This_symb_has_been_depreciated
#define OCIFT_OCIFT_2                               This_symb_has_been_depreciated
#define OCIFT_OCIFT3_MASK                           This_symb_has_been_depreciated
#define OCIFT_OCIFT_2_MASK                          This_symb_has_been_depreciated
#define OCIFT_OCIFT_2_BITNUM                        This_symb_has_been_depreciated
#define PTS                                         This_symb_has_been_depreciated
#define PTS_PTS0                                    This_symb_has_been_depreciated
#define PTS_PTS1                                    This_symb_has_been_depreciated
#define PTS_PTS                                     This_symb_has_been_depreciated
#define PTS_PTS0_MASK                               This_symb_has_been_depreciated
#define PTS_PTS1_MASK                               This_symb_has_been_depreciated
#define PTS_PTS_MASK                                This_symb_has_been_depreciated
#define PTS_PTS_BITNUM                              This_symb_has_been_depreciated
#define PTIS                                        This_symb_has_been_depreciated
#define PTIS_PTIS0                                  This_symb_has_been_depreciated
#define PTIS_PTIS1                                  This_symb_has_been_depreciated
#define PTIS_PTIS                                   This_symb_has_been_depreciated
#define PTIS_PTIS0_MASK                             This_symb_has_been_depreciated
#define PTIS_PTIS1_MASK                             This_symb_has_been_depreciated
#define PTIS_PTIS_MASK                              This_symb_has_been_depreciated
#define PTIS_PTIS_BITNUM                            This_symb_has_been_depreciated
#define DDRS                                        This_symb_has_been_depreciated
#define DDRS_DDRS0                                  This_symb_has_been_depreciated
#define DDRS_DDRS1                                  This_symb_has_been_depreciated
#define DDRS_DDRS                                   This_symb_has_been_depreciated
#define DDRS_DDRS0_MASK                             This_symb_has_been_depreciated
#define DDRS_DDRS1_MASK                             This_symb_has_been_depreciated
#define DDRS_DDRS_MASK                              This_symb_has_been_depreciated
#define DDRS_DDRS_BITNUM                            This_symb_has_been_depreciated
#define PERS                                        This_symb_has_been_depreciated
#define PERS_PERS0                                  This_symb_has_been_depreciated
#define PERS_PERS1                                  This_symb_has_been_depreciated
#define PERS_PERS                                   This_symb_has_been_depreciated
#define PERS_PERS0_MASK                             This_symb_has_been_depreciated
#define PERS_PERS1_MASK                             This_symb_has_been_depreciated
#define PERS_PERS_MASK                              This_symb_has_been_depreciated
#define PERS_PERS_BITNUM                            This_symb_has_been_depreciated
#define PPSS                                        This_symb_has_been_depreciated
#define PPSS_PPSS0                                  This_symb_has_been_depreciated
#define PPSS_PPSS1                                  This_symb_has_been_depreciated
#define PPSS_PPSS                                   This_symb_has_been_depreciated
#define PPSS_PPSS0_MASK                             This_symb_has_been_depreciated
#define PPSS_PPSS1_MASK                             This_symb_has_been_depreciated
#define PPSS_PPSS_MASK                              This_symb_has_been_depreciated
#define PPSS_PPSS_BITNUM                            This_symb_has_been_depreciated
#define PIES                                        This_symb_has_been_depreciated
#define PIES_PIES0                                  This_symb_has_been_depreciated
#define PIES_PIES1                                  This_symb_has_been_depreciated
#define PIES_PIES                                   This_symb_has_been_depreciated
#define PIES_PIES0_MASK                             This_symb_has_been_depreciated
#define PIES_PIES1_MASK                             This_symb_has_been_depreciated
#define PIES_PIES_MASK                              This_symb_has_been_depreciated
#define PIES_PIES_BITNUM                            This_symb_has_been_depreciated
#define PIFS                                        This_symb_has_been_depreciated
#define PIFS_PIFS0                                  This_symb_has_been_depreciated
#define PIFS_PIFS1                                  This_symb_has_been_depreciated
#define PIFS_PIFS                                   This_symb_has_been_depreciated
#define PIFS_PIFS0_MASK                             This_symb_has_been_depreciated
#define PIFS_PIFS1_MASK                             This_symb_has_been_depreciated
#define PIFS_PIFS_MASK                              This_symb_has_been_depreciated
#define PIFS_PIFS_BITNUM                            This_symb_has_been_depreciated
#define WOMS                                        This_symb_has_been_depreciated
#define WOMS_WOMS0                                  This_symb_has_been_depreciated
#define WOMS_WOMS1                                  This_symb_has_been_depreciated
#define WOMS_WOMS                                   This_symb_has_been_depreciated
#define WOMS_WOMS0_MASK                             This_symb_has_been_depreciated
#define WOMS_WOMS1_MASK                             This_symb_has_been_depreciated
#define WOMS_WOMS_MASK                              This_symb_has_been_depreciated
#define WOMS_WOMS_BITNUM                            This_symb_has_been_depreciated
#define OCPEP_OCPEP1                                This_symb_has_been_depreciated
#define OCPEP_OCPEP                                 This_symb_has_been_depreciated
#define OCPEP_OCPEP1_MASK                           This_symb_has_been_depreciated
#define OCPEP_OCPEP_MASK                            This_symb_has_been_depreciated
#define OCPEP_OCPEP_BITNUM                          This_symb_has_been_depreciated
#define OCIEP_OCIEP1                                This_symb_has_been_depreciated
#define OCIEP_OCIEP                                 This_symb_has_been_depreciated
#define OCIEP_OCIEP1_MASK                           This_symb_has_been_depreciated
#define OCIEP_OCIEP_MASK                            This_symb_has_been_depreciated
#define OCIEP_OCIEP_BITNUM                          This_symb_has_been_depreciated
#define OCIFP_OCIFP1                                This_symb_has_been_depreciated
#define OCIFP_OCIFP                                 This_symb_has_been_depreciated
#define OCIFP_OCIFP1_MASK                           This_symb_has_been_depreciated
#define OCIFP_OCIFP_MASK                            This_symb_has_been_depreciated
#define OCIFP_OCIFP_BITNUM                          This_symb_has_been_depreciated
#define RDRP_RDRP1                                  This_symb_has_been_depreciated
#define RDRP_RDRP                                   This_symb_has_been_depreciated
#define RDRP_RDRP1_MASK                             This_symb_has_been_depreciated
#define RDRP_RDRP_MASK                              This_symb_has_been_depreciated
#define RDRP_RDRP_BITNUM                            This_symb_has_been_depreciated
#define TIM0TIOS_IOS4                               This_symb_has_been_depreciated
#define TIM0TIOS_IOS5                               This_symb_has_been_depreciated
#define TIM0TIOS_IOS6                               This_symb_has_been_depreciated
#define TIM0TIOS_IOS7                               This_symb_has_been_depreciated
#define TIM0TIOS_IOS4_MASK                          This_symb_has_been_depreciated
#define TIM0TIOS_IOS5_MASK                          This_symb_has_been_depreciated
#define TIM0TIOS_IOS6_MASK                          This_symb_has_been_depreciated
#define TIM0TIOS_IOS7_MASK                          This_symb_has_been_depreciated
#define TIM0CFORC_FOC4                              This_symb_has_been_depreciated
#define TIM0CFORC_FOC5                              This_symb_has_been_depreciated
#define TIM0CFORC_FOC6                              This_symb_has_been_depreciated
#define TIM0CFORC_FOC7                              This_symb_has_been_depreciated
#define TIM0CFORC_FOC4_MASK                         This_symb_has_been_depreciated
#define TIM0CFORC_FOC5_MASK                         This_symb_has_been_depreciated
#define TIM0CFORC_FOC6_MASK                         This_symb_has_been_depreciated
#define TIM0CFORC_FOC7_MASK                         This_symb_has_been_depreciated
#define TIM0OC7M                                    This_symb_has_been_depreciated
#define TIM0OC7M_OC7M0                              This_symb_has_been_depreciated
#define TIM0OC7M_OC7M1                              This_symb_has_been_depreciated
#define TIM0OC7M_OC7M2                              This_symb_has_been_depreciated
#define TIM0OC7M_OC7M3                              This_symb_has_been_depreciated
#define TIM0OC7M_OC7M4                              This_symb_has_been_depreciated
#define TIM0OC7M_OC7M5                              This_symb_has_been_depreciated
#define TIM0OC7M_OC7M6                              This_symb_has_been_depreciated
#define TIM0OC7M_OC7M7                              This_symb_has_been_depreciated
#define TIM0OC7M_OC7M0_MASK                         This_symb_has_been_depreciated
#define TIM0OC7M_OC7M1_MASK                         This_symb_has_been_depreciated
#define TIM0OC7M_OC7M2_MASK                         This_symb_has_been_depreciated
#define TIM0OC7M_OC7M3_MASK                         This_symb_has_been_depreciated
#define TIM0OC7M_OC7M4_MASK                         This_symb_has_been_depreciated
#define TIM0OC7M_OC7M5_MASK                         This_symb_has_been_depreciated
#define TIM0OC7M_OC7M6_MASK                         This_symb_has_been_depreciated
#define TIM0OC7M_OC7M7_MASK                         This_symb_has_been_depreciated
#define TIM0OC7D                                    This_symb_has_been_depreciated
#define TIM0OC7D_OC7D0                              This_symb_has_been_depreciated
#define TIM0OC7D_OC7D1                              This_symb_has_been_depreciated
#define TIM0OC7D_OC7D2                              This_symb_has_been_depreciated
#define TIM0OC7D_OC7D3                              This_symb_has_been_depreciated
#define TIM0OC7D_OC7D4                              This_symb_has_been_depreciated
#define TIM0OC7D_OC7D5                              This_symb_has_been_depreciated
#define TIM0OC7D_OC7D6                              This_symb_has_been_depreciated
#define TIM0OC7D_OC7D7                              This_symb_has_been_depreciated
#define TIM0OC7D_OC7D0_MASK                         This_symb_has_been_depreciated
#define TIM0OC7D_OC7D1_MASK                         This_symb_has_been_depreciated
#define TIM0OC7D_OC7D2_MASK                         This_symb_has_been_depreciated
#define TIM0OC7D_OC7D3_MASK                         This_symb_has_been_depreciated
#define TIM0OC7D_OC7D4_MASK                         This_symb_has_been_depreciated
#define TIM0OC7D_OC7D5_MASK                         This_symb_has_been_depreciated
#define TIM0OC7D_OC7D6_MASK                         This_symb_has_been_depreciated
#define TIM0OC7D_OC7D7_MASK                         This_symb_has_been_depreciated
#define TIM0TTOV_TOV4                               This_symb_has_been_depreciated
#define TIM0TTOV_TOV5                               This_symb_has_been_depreciated
#define TIM0TTOV_TOV6                               This_symb_has_been_depreciated
#define TIM0TTOV_TOV7                               This_symb_has_been_depreciated
#define TIM0TTOV_TOV4_MASK                          This_symb_has_been_depreciated
#define TIM0TTOV_TOV5_MASK                          This_symb_has_been_depreciated
#define TIM0TTOV_TOV6_MASK                          This_symb_has_been_depreciated
#define TIM0TTOV_TOV7_MASK                          This_symb_has_been_depreciated
#define TIM0TCTL1                                   This_symb_has_been_depreciated
#define TIM0TCTL1_OL4                               This_symb_has_been_depreciated
#define TIM0TCTL1_OM4                               This_symb_has_been_depreciated
#define TIM0TCTL1_OL5                               This_symb_has_been_depreciated
#define TIM0TCTL1_OM5                               This_symb_has_been_depreciated
#define TIM0TCTL1_OL6                               This_symb_has_been_depreciated
#define TIM0TCTL1_OM6                               This_symb_has_been_depreciated
#define TIM0TCTL1_OL7                               This_symb_has_been_depreciated
#define TIM0TCTL1_OM7                               This_symb_has_been_depreciated
#define TIM0TCTL1_OL4_MASK                          This_symb_has_been_depreciated
#define TIM0TCTL1_OM4_MASK                          This_symb_has_been_depreciated
#define TIM0TCTL1_OL5_MASK                          This_symb_has_been_depreciated
#define TIM0TCTL1_OM5_MASK                          This_symb_has_been_depreciated
#define TIM0TCTL1_OL6_MASK                          This_symb_has_been_depreciated
#define TIM0TCTL1_OM6_MASK                          This_symb_has_been_depreciated
#define TIM0TCTL1_OL7_MASK                          This_symb_has_been_depreciated
#define TIM0TCTL1_OM7_MASK                          This_symb_has_been_depreciated
#define TIM0TCTL3                                   This_symb_has_been_depreciated
#define TIM0TCTL3_EDG4A                             This_symb_has_been_depreciated
#define TIM0TCTL3_EDG4B                             This_symb_has_been_depreciated
#define TIM0TCTL3_EDG5A                             This_symb_has_been_depreciated
#define TIM0TCTL3_EDG5B                             This_symb_has_been_depreciated
#define TIM0TCTL3_EDG6A                             This_symb_has_been_depreciated
#define TIM0TCTL3_EDG6B                             This_symb_has_been_depreciated
#define TIM0TCTL3_EDG7A                             This_symb_has_been_depreciated
#define TIM0TCTL3_EDG7B                             This_symb_has_been_depreciated
#define TIM0TCTL3_EDG4x                             This_symb_has_been_depreciated
#define TIM0TCTL3_EDG5x                             This_symb_has_been_depreciated
#define TIM0TCTL3_EDG6x                             This_symb_has_been_depreciated
#define TIM0TCTL3_EDG7x                             This_symb_has_been_depreciated
#define TIM0TCTL3_EDG4A_MASK                        This_symb_has_been_depreciated
#define TIM0TCTL3_EDG4B_MASK                        This_symb_has_been_depreciated
#define TIM0TCTL3_EDG5A_MASK                        This_symb_has_been_depreciated
#define TIM0TCTL3_EDG5B_MASK                        This_symb_has_been_depreciated
#define TIM0TCTL3_EDG6A_MASK                        This_symb_has_been_depreciated
#define TIM0TCTL3_EDG6B_MASK                        This_symb_has_been_depreciated
#define TIM0TCTL3_EDG7A_MASK                        This_symb_has_been_depreciated
#define TIM0TCTL3_EDG7B_MASK                        This_symb_has_been_depreciated
#define TIM0TCTL3_EDG4x_MASK                        This_symb_has_been_depreciated
#define TIM0TCTL3_EDG4x_BITNUM                      This_symb_has_been_depreciated
#define TIM0TCTL3_EDG5x_MASK                        This_symb_has_been_depreciated
#define TIM0TCTL3_EDG5x_BITNUM                      This_symb_has_been_depreciated
#define TIM0TCTL3_EDG6x_MASK                        This_symb_has_been_depreciated
#define TIM0TCTL3_EDG6x_BITNUM                      This_symb_has_been_depreciated
#define TIM0TCTL3_EDG7x_MASK                        This_symb_has_been_depreciated
#define TIM0TCTL3_EDG7x_BITNUM                      This_symb_has_been_depreciated
#define TIM0TIE_C5I                                 This_symb_has_been_depreciated
#define TIM0TIE_C4I                                 This_symb_has_been_depreciated
#define TIM0TIE_C6I                                 This_symb_has_been_depreciated
#define TIM0TIE_C7I                                 This_symb_has_been_depreciated
#define TIM0TIE_C4I_MASK                            This_symb_has_been_depreciated
#define TIM0TIE_C5I_MASK                            This_symb_has_been_depreciated
#define TIM0TIE_C6I_MASK                            This_symb_has_been_depreciated
#define TIM0TIE_C7I_MASK                            This_symb_has_been_depreciated
#define TIM0TSCR2_TCRE                              This_symb_has_been_depreciated
#define TIM0TSCR2_TCRE_MASK                         This_symb_has_been_depreciated
#define TIM0TFLG1_C4F                               This_symb_has_been_depreciated
#define TIM0TFLG1_C5F                               This_symb_has_been_depreciated
