ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVMB_example/Toledo_S12ZVMBA64/S12ZVMBA64_LIN_Slave/Project_Headers/mc9s12zvmba64.h
#define TIM0TFLG1_C6F                               This_symb_has_been_depreciated
#define TIM0TFLG1_C7F                               This_symb_has_been_depreciated
#define TIM0TFLG1_C4F_MASK                          This_symb_has_been_depreciated
#define TIM0TFLG1_C5F_MASK                          This_symb_has_been_depreciated
#define TIM0TFLG1_C6F_MASK                          This_symb_has_been_depreciated
#define TIM0TFLG1_C7F_MASK                          This_symb_has_been_depreciated
#define TIM0TC4                                     This_symb_has_been_depreciated
#define TIM0TC5Hi                                   This_symb_has_been_depreciated
#define TIM0TC5H                                    This_symb_has_been_depreciated
#define TIM0TC5Lo                                   This_symb_has_been_depreciated
#define TIM0TC5L                                    This_symb_has_been_depreciated
#define TIM0TC6Hi                                   This_symb_has_been_depreciated
#define TIM0TC6H                                    This_symb_has_been_depreciated
#define TIM0TC6Lo                                   This_symb_has_been_depreciated
#define TIM0TC6L                                    This_symb_has_been_depreciated
#define TIM0TC6                                     This_symb_has_been_depreciated
#define TIM0TC7Hi                                   This_symb_has_been_depreciated
#define TIM0TC7H                                    This_symb_has_been_depreciated
#define TIM0TC7Lo                                   This_symb_has_been_depreciated
#define TIM0TC7L                                    This_symb_has_been_depreciated
#define TIM0TC7                                     This_symb_has_been_depreciated
#define TIM0PACTL                                   This_symb_has_been_depreciated
#define TIM0PACTL_PAI                               This_symb_has_been_depreciated
#define TIM0PACTL_PAOVI                             This_symb_has_been_depreciated
#define TIM0PACTL_CLK0                              This_symb_has_been_depreciated
#define TIM0PACTL_CLK1                              This_symb_has_been_depreciated
#define TIM0PACTL_PEDGE                             This_symb_has_been_depreciated
#define TIM0PACTL_PAMOD                             This_symb_has_been_depreciated
#define TIM0PACTL_PAEN                              This_symb_has_been_depreciated
#define TIM0PACTL_CLK                               This_symb_has_been_depreciated
#define TIM0PACTL_PAI_MASK                          This_symb_has_been_depreciated
#define TIM0PACTL_PAOVI_MASK                        This_symb_has_been_depreciated
#define TIM0PACTL_CLK0_MASK                         This_symb_has_been_depreciated
#define TIM0PACTL_CLK1_MASK                         This_symb_has_been_depreciated
#define TIM0PACTL_PEDGE_MASK                        This_symb_has_been_depreciated
#define TIM0PACTL_PAMOD_MASK                        This_symb_has_been_depreciated
#define TIM0PACTL_PAEN_MASK                         This_symb_has_been_depreciated
#define TIM0PACTL_CLK_MASK                          This_symb_has_been_depreciated
#define TIM0PACTL_CLK_BITNUM                        This_symb_has_been_depreciated
#define TIM0PAFLG                                   This_symb_has_been_depreciated
#define TIM0PAFLG_PAIF                              This_symb_has_been_depreciated
#define TIM0PAFLG_PAOVF                             This_symb_has_been_depreciated
#define TIM0PACNTH                                  This_symb_has_been_depreciated
#define TIM0PACNTL                                  This_symb_has_been_depreciated
#define TIM0PACNT                                   This_symb_has_been_depreciated
#define TIM0OCPD_OCPD4                              This_symb_has_been_depreciated
#define TIM0OCPD_OCPD5                              This_symb_has_been_depreciated
#define TIM0OCPD_OCPD6                              This_symb_has_been_depreciated
#define TIM0OCPD_OCPD7                              This_symb_has_been_depreciated
#define TIM0OCPD_OCPD4_MASK                         This_symb_has_been_depreciated
#define TIM0OCPD_OCPD5_MASK                         This_symb_has_been_depreciated
#define TIM0OCPD_OCPD6_MASK                         This_symb_has_been_depreciated
#define TIM0OCPD_OCPD7_MASK                         This_symb_has_been_depreciated
#define ADC0CMD_1_VRL_SEL                           This_symb_has_been_depreciated
#define ADC0CMD_1_VRL_SEL_MASK                      This_symb_has_been_depreciated
#define ADC0CMD_01_VRL_SEL                          This_symb_has_been_depreciated
#define ADC0CMD_01_VRL_SEL_MASK                     This_symb_has_been_depreciated
#define GDUE_EPRES                                  This_symb_has_been_depreciated
#define GDUE_EPRES_MASK                             This_symb_has_been_depreciated
#define CPMUVREGCTL2                                This_symb_has_been_depreciated
#define CPMUVREGCTL2_VREGTRIM33V                    This_symb_has_been_depreciated
#define CPMUVREGCTL2_VREGTRIM5V                     This_symb_has_been_depreciated
#define CPMUVREGCTL2_VREG5VEN                       This_symb_has_been_depreciated
#define CPMUVREGCTL2_VREGTRIM33V_MASK               This_symb_has_been_depreciated
#define CPMUVREGCTL2_VREGTRIM33V_BITNUM             This_symb_has_been_depreciated
#define CPMUVREGCTL2_VREGTRIM5V_MASK                This_symb_has_been_depreciated
#define CPMUVREGCTL2_VREGTRIM5V_BITNUM              This_symb_has_been_depreciated
#define CPMUVREGCTL2_VREG5VEN_MASK                  This_symb_has_been_depreciated
#define CPMUOSC2_HIAMP                              This_symb_has_been_depreciated
#define CPMUOSC2_LOWRFB                             This_symb_has_been_depreciated
#define CPMUOSC2_ACOTA                              This_symb_has_been_depreciated
#define CPMUOSC2_ACAMP                              This_symb_has_been_depreciated
#define CPMUOSC2_CLKIEN                             This_symb_has_been_depreciated
#define CPMUOSC2_CLKOEN                             This_symb_has_been_depreciated
#define CPMUOSC2_HIAMP_MASK                         This_symb_has_been_depreciated
#define CPMUOSC2_LOWRFB_MASK                        This_symb_has_been_depreciated
#define CPMUOSC2_ACOTA_MASK                         This_symb_has_been_depreciated
#define CPMUOSC2_ACAMP_MASK                         This_symb_has_been_depreciated
#define CPMUOSC2_CLKIEN_MASK                        This_symb_has_been_depreciated
#define CPMUOSC2_CLKOEN_MASK                        This_symb_has_been_depreciated
#define HSTST                                       This_symb_has_been_depreciated
#define HSTST_HSOC0                                 This_symb_has_been_depreciated
#define HSTST_HSOC1                                 This_symb_has_been_depreciated
#define HSTST_NOCOFF                                This_symb_has_been_depreciated
#define HSTST_HSOC                                  This_symb_has_been_depreciated
#define HSTST_HSOC0_MASK                            This_symb_has_been_depreciated
#define HSTST_HSOC1_MASK                            This_symb_has_been_depreciated
#define HSTST_NOCOFF_MASK                           This_symb_has_been_depreciated
#define HSTST_HSOC_MASK                             This_symb_has_been_depreciated
#define HSTST_HSOC_BITNUM                           This_symb_has_been_depreciated
#define MODRR0_P0C4RR                               MODRR4_P0C4RR
#define MODRR0_P0C5RR                               MODRR4_P0C5RR
#define MODRR0_P0C4RR_MASK                          MODRR4_P0C4RR_MASK
#define MODRR0_P0C5RR_MASK                          MODRR4_P0C5RR_MASK

/* **** 22/01/2016 11:22:00 AM */

#define GDUCTR1_GSLEWMOD                            This_symb_has_been_depreciated
#define GDUCTR1_GSLEWMOD_MASK                       This_symb_has_been_depreciated
/*lint -restore  +esym(960,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */
#endif
